; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-61)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b5)
    (on b5 b14)
    (on b14 b18)
    (on b18 b10)
    (on b10 b17)
    (on b17 b2)
    (on b2 b8)
    (on b8 b6)
    (on b6 b12)
    (on b12 b9)
    (on-table b9)
    (clear b1)
    (on b1 b16)
    (on b16 b3)
    (on b3 b15)
    (on b15 b11)
    (on b11 b7)
    (on b7 b13)
    (on-table b13))
 (:goal (and 
(on b17 b18)
))
)

; plan
1. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 0 of 1
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
3. (unstack b5 b14)
   deleted: (on b5 b14) (clear b5) (arm-empty)
   added: (holding b5) (clear b14)
   goals met: 0 of 1
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
5. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 0 of 1
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
7. (unstack b18 b10)
   deleted: (on b18 b10) (clear b18) (arm-empty)
   added: (holding b18) (clear b10)
   goals met: 0 of 1
8. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
9. (unstack b10 b17)
   deleted: (on b10 b17) (clear b10) (arm-empty)
   added: (holding b10) (clear b17)
   goals met: 0 of 1
10. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
11. (unstack b17 b2)
   deleted: (on b17 b2) (clear b17) (arm-empty)
   added: (holding b17) (clear b2)
   goals met: 0 of 1
12. (stack b17 b18)
   deleted: (clear b18) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b18)
   goals met: 1 of 1
